from search import models

buildings_data = [
    (1, 'Учебный корпус №2', 'г. Петропавловск-Камчатский, ул. Ленинградская, 43'),
    (2, 'Учебный корпус №3', 'г. Петропавловск-Камчатский, ул. Ленинградская, 41А.'),
    (3, 'Учебный корпус №6', 'г. Петропавловск-Камчатский, ул. Вилюйская, 56'),
    (4, 'Учебный корпус №7', 'г. Петропавловск-Камчатский, ул. Ключевская, 54'),
    (5, 'Административный корпус', 'г. Петропавловск-Камчатский, ул. Ключевская, 35'),
    (6, 'Химический корпус', 'г. Петропавловск-Камчатский, ул. Ключевская, 41'),
    (7, 'Учебный корпус №1', 'г. Петропавловск – Камчатский, ул. Ключевская, 56'),
    (8, "Актовый зал", 'г. Петропавловск – Камчатский, ул. Ключевская, 56'),
    (9, "Библиотека", 'г. Петропавловск – Камчатский, ул. Ключевская, 56'),
    (10, "Столовая", 'г. Петропавловск – Камчатский, ул. Ключевская, 56'),

]

departments_data = [
    (1, 'ИНФОРМАЦИОННЫЕ СИСТЕМЫ', 4),
    (2, 'ФИЗИКА И ВЫСШАЯ МАТЕМАТИКА', 4),
    (3, 'СИСТЕМЫ УПРАВЛЕНИЯ', 4),
    (4, 'ЭКОНОМИКА И МЕНЕДЖМЕНТ', 4),
    (5, 'ИСТОРИЯ И ФИЛОСОФИЯ', 4),
    (6, 'ЭНЕРГЕТИЧЕСКИЕ УСТАНОВКИ И ЭЛЕКТРООБОРУДОВАНИЕ СУДОВ', 2),
    (7, 'ТЕХНОЛОГИЧЕСКИЕ МАШИНЫ И ОБОРУДОВАНИЕ', 2),
    (8, 'ИНОСТРАННЫЕ ЯЗЫКИ', 4),
    (9, 'ФИЗИЧЕСКАЯ КУЛЬТУРА', 1)
]

teachers_data = [
    (1, 'Агафонов В. В.', 5),
    (2, 'Агунович Ю. А.', 4),
    (3, 'Байназаров И. Н.', 9),
    (4, 'Батуев Э. Н.', 2),
    (5, 'Безуглая Г. В.', 5),
    (6, 'Белова Е. П.', 8),
    (7, 'Бобров М. Ю.', 9),
    (8, 'Богданова Т. И.', 4),
    (9, 'Водинчар Г. М.', 3),
    (10, 'Волков В. С.', 8),
    (11, 'Горюнова Л. А.', 3),
    (12, 'Гришанович А. А.', None),
    (13, 'Еремина М. Ю.', 4),
    (14, 'Ерискина Н. В.', 5),
    (15, 'Задорожный А. И.', 2),
    (16, 'Зуева Л. Н.', 9),
    (17, 'Казаков Е. А.', 3),
    (18, 'Кирюхин А. В.', 1),
    (19, 'Ковалев И. А.', 9),
    (20, 'Коростылев Д. А.', None),
    (21, 'Кравцов С. А', 4),
    (22, 'Крючкова И. А.', 8),
    (23, 'Левская И. В.', 4),
    (24, 'Лутцева Е. А.', 3),
    (25, 'Малова Е. А.', 1),
    (26, 'Мандрикова О. В.', 3),
    (27, 'Марапулец Ю. В.', 3),
    (28, 'Марченко А. А.', 3),
    (29, 'Мищенко М. Ю.', 3),
    (30, 'Морозова Ю. С.', 4),
    (31, 'Назаренко Д. Н.', 4),
    (32, 'Панов В. К.', 2),
    (33, 'Поварницына Т. С.', 8),
    (34, 'Проценко И. Г.', 1),
    (35, 'Пюкке Г. А.', 3),
    (36, 'Россолова О. А.', 5),
    (37, 'Рычка И. А.', 1),
    (38, 'Сивоконь В. П.', 6),
    (39, 'Симахина М. А.', 2),
    (40, 'Соколова Т. П.', 9),
    (41, 'Степанова Е. А.', 7),
    (42, 'Тараникова Ю. Н.', 2),
    (43, 'Труднев С. Ю.', 6),
    (44, 'Фрумак И. В.', 4),
    (45, 'Чебанюк С. В.', 1),
    (46, 'Чермошенцева А. А.', 2),
    (48, 'Шуликов А. О.', 4)
]

for data in buildings_data:
    idx, name, address = data
    building = models.Building.objects.create(name=name, address=address)
    
for data in departments_data:
    idx, name, building_id = data
    department = models.Department.objects.create(name=name)
    if building_id is not None:
        building = models.Building.objects.get(pk=building_id)
        building.departments.add(department)
        building.save()

for data in teachers_data:
    idx, name, department_id = data
    if department_id is not None:
        teacher =  models.Teacher.objects.create(fullname=name, department_id=department_id)
    else:
        teacher =  models.Teacher.objects.create(fullname=name)

